Movie Studio

In the last 10 years, which genre was the most profitable at the box office. profits between genres.

Most popular english movies filtered by user rating??? filters - year, english, gross profit, user rating, best director 3 recommendations? comedy vs drama

In [202]:
from scipy import stats

import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

import pandas as pd
import numpy as np

import sqlite3
import zipfile

import warnings
warnings.filterwarnings('ignore')

In [203]:
movie_budget = pd.read_csv("data/tn.movie_budgets.csv.gz", sep= ",")

In [204]:
movie_budget.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [205]:
movie_budget.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [220]:
movie_budget_copy = movie_budget.copy()

movie_budget_copy['release_date'] = pd.to_datetime(movie_budget_copy['release_date'], errors='coerce')

movie_budget_copy['release_year'] = pd.to_datetime(movie_budget_copy['release_date']).dt.year

# Extract the month from the 'release_date' column
movie_budget_copy['release_month'] = movie_budget_copy['release_date'].dt.month

# Display the DataFrame with the new 'release_month' column
movie_budget_copy

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_month,release_year
0,1,2009-12-18,Avatar,"$425,000,000","$760,507,625","$2,776,345,279",12,2009
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",5,2011
2,3,2019-06-07,Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",6,2019
3,4,2015-05-01,Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",5,2015
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747",12,2017
...,...,...,...,...,...,...,...,...
5777,78,2018-12-31,Red 11,"$7,000",$0,$0,12,2018
5778,79,1999-04-02,Following,"$6,000","$48,482","$240,495",4,1999
5779,80,2005-07-13,Return to the Land of Wonders,"$5,000","$1,338","$1,338",7,2005
5780,81,2015-09-29,A Plague So Pleasant,"$1,400",$0,$0,9,2015
5781,82,2005-08-05,My Date With Drew,"$1,100","$181,041","$181,041",8,2005

In [221]:
result_sql = pd.merge(movie_budget_copy[['release_date', 'movie', 'production_budget', 'domestic_gross', 'worldwide_gross', "release_year", "release_month"]], movie_basic[['primary_title', 'original_title', 'start_year', 'genres']], left_on='movie', right_on='primary_title', how='inner')

result_sql

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year,release_month,primary_title,original_title,start_year,genres
0,2009-12-18,Avatar,"$425,000,000","$760,507,625","$2,776,345,279",2009,12,Avatar,Abatâ,2011,Horror
1,2011-05-20,Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",2011,5,Pirates of the Caribbean: On Stranger Tides,Pirates of the Caribbean: On Stranger Tides,2011,"Action,Adventure,Fantasy"
2,2019-06-07,Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",2019,6,Dark Phoenix,Dark Phoenix,2019,"Action,Adventure,Sci-Fi"
3,2015-05-01,Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",2015,5,Avengers: Age of Ultron,Avengers: Age of Ultron,2015,"Action,Adventure,Sci-Fi"
4,2018-04-27,Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200",2018,4,Avengers: Infinity War,Avengers: Infinity War,2018,"Action,Adventure,Sci-Fi"
...,...,...,...,...,...,...,...,...,...,...,...
3810,2001-07-06,Cure,"$10,000","$94,596","$94,596",2001,7,Cure,Cure,2014,None
3811,1996-04-01,Bang,"$10,000",$527,$527,1996,4,Bang,Bang,2015,None
3812,2012-01-13,Newlyweds,"$9,000","$4,584","$4,584",2012,1,Newlyweds,Newlyweds,2011,"Comedy,Drama"
3813,2018-12-31,Red 11,"$7,000",$0,$0,2018,12,Red 11,Red 11,2019,"Horror,Sci-Fi,Thriller"
3814,2015-09-29,A Plague So Pleasant,"$1,400",$0,$0,2015,9,A Plague So Pleasant,A Plague So Pleasant,2013,"Drama,Horror,Thriller"

In [222]:
result_sql['worldwide_gross'] = result_sql['worldwide_gross'].str.replace('$', '').str.replace(',', '').astype(float)
result_sql['production_budget'] = result_sql['production_budget'].str.replace('$', '').str.replace(',', '').astype(float)

result_sql['ROI'] = (result_sql['worldwide_gross'] / result_sql['production_budget']) * 100

result_sql

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year,release_month,primary_title,original_title,start_year,genres,ROI
0,2009-12-18,Avatar,425000000.0,"$760,507,625",2.776345e+09,2009,12,Avatar,Abatâ,2011,Horror,653.257713
1,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000.0,"$241,063,875",1.045664e+09,2011,5,Pirates of the Caribbean: On Stranger Tides,Pirates of the Caribbean: On Stranger Tides,2011,"Action,Adventure,Fantasy",254.667286
2,2019-06-07,Dark Phoenix,350000000.0,"$42,762,350",1.497624e+08,2019,6,Dark Phoenix,Dark Phoenix,2019,"Action,Adventure,Sci-Fi",42.789243
3,2015-05-01,Avengers: Age of Ultron,330600000.0,"$459,005,868",1.403014e+09,2015,5,Avengers: Age of Ultron,Avengers: Age of Ultron,2015,"Action,Adventure,Sci-Fi",424.384139
4,2018-04-27,Avengers: Infinity War,300000000.0,"$678,815,482",2.048134e+09,2018,4,Avengers: Infinity War,Avengers: Infinity War,2018,"Action,Adventure,Sci-Fi",682.711400
...,...,...,...,...,...,...,...,...,...,...,...,...
3810,2001-07-06,Cure,10000.0,"$94,596",9.459600e+04,2001,7,Cure,Cure,2014,None,945.960000
3811,1996-04-01,Bang,10000.0,$527,5.270000e+02,1996,4,Bang,Bang,2015,None,5.270000
3812,2012-01-13,Newlyweds,9000.0,"$4,584",4.584000e+03,2012,1,Newlyweds,Newlyweds,2011,"Comedy,Drama",50.933333
3813,2018-12-31,Red 11,7000.0,$0,0.000000e+00,2018,12,Red 11,Red 11,2019,"Horror,Sci-Fi,Thriller",0.000000
3814,2015-09-29,A Plague So Pleasant,1400.0,$0,0.000000e+00,2015,9,A Plague So Pleasant,A Plague So Pleasant,2013,"Drama,Horror,Thriller",0.000000

In [223]:
year = result_sql[result_sql['start_year'] <= 2020]
year

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year,release_month,primary_title,original_title,start_year,genres,ROI
0,2009-12-18,Avatar,425000000.0,"$760,507,625",2.776345e+09,2009,12,Avatar,Abatâ,2011,Horror,653.257713
1,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000.0,"$241,063,875",1.045664e+09,2011,5,Pirates of the Caribbean: On Stranger Tides,Pirates of the Caribbean: On Stranger Tides,2011,"Action,Adventure,Fantasy",254.667286
2,2019-06-07,Dark Phoenix,350000000.0,"$42,762,350",1.497624e+08,2019,6,Dark Phoenix,Dark Phoenix,2019,"Action,Adventure,Sci-Fi",42.789243
3,2015-05-01,Avengers: Age of Ultron,330600000.0,"$459,005,868",1.403014e+09,2015,5,Avengers: Age of Ultron,Avengers: Age of Ultron,2015,"Action,Adventure,Sci-Fi",424.384139
4,2018-04-27,Avengers: Infinity War,300000000.0,"$678,815,482",2.048134e+09,2018,4,Avengers: Infinity War,Avengers: Infinity War,2018,"Action,Adventure,Sci-Fi",682.711400
...,...,...,...,...,...,...,...,...,...,...,...,...
3810,2001-07-06,Cure,10000.0,"$94,596",9.459600e+04,2001,7,Cure,Cure,2014,None,945.960000
3811,1996-04-01,Bang,10000.0,$527,5.270000e+02,1996,4,Bang,Bang,2015,None,5.270000
3812,2012-01-13,Newlyweds,9000.0,"$4,584",4.584000e+03,2012,1,Newlyweds,Newlyweds,2011,"Comedy,Drama",50.933333
3813,2018-12-31,Red 11,7000.0,$0,0.000000e+00,2018,12,Red 11,Red 11,2019,"Horror,Sci-Fi,Thriller",0.000000
3814,2015-09-29,A Plague So Pleasant,1400.0,$0,0.000000e+00,2015,9,A Plague So Pleasant,A Plague So Pleasant,2013,"Drama,Horror,Thriller",0.000000

In [224]:
budget_filter = result_sql[result_sql["production_budget"] <= 80000000.0]
budget_filter

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year,release_month,primary_title,original_title,start_year,genres,ROI
20,1998-08-14,The Avengers,60000000.0,"$23,385,416",48585416.0,1998,8,The Avengers,The Avengers,2012,"Action,Adventure,Sci-Fi",80.975693
39,1976-12-17,King Kong,23000000.0,"$52,614,445",90614445.0,1976,12,King Kong,King Kong,2018,"Action,Adventure",393.975848
40,1933-04-07,King Kong,672000.0,"$10,000,000",10000650.0,1933,4,King Kong,King Kong,2018,"Action,Adventure",1488.191964
52,1951-07-28,Alice in Wonderland,3000000.0,$0,0.0,1951,7,Alice in Wonderland,Alice in Wonderland,2010,"Adventure,Family,Fantasy",0.000000
53,1951-07-28,Alice in Wonderland,3000000.0,$0,0.0,1951,7,Alice in Wonderland,Alice in Wonderland,2011,Documentary,0.000000
...,...,...,...,...,...,...,...,...,...,...,...,...
3810,2001-07-06,Cure,10000.0,"$94,596",94596.0,2001,7,Cure,Cure,2014,None,945.960000
3811,1996-04-01,Bang,10000.0,$527,527.0,1996,4,Bang,Bang,2015,None,5.270000
3812,2012-01-13,Newlyweds,9000.0,"$4,584",4584.0,2012,1,Newlyweds,Newlyweds,2011,"Comedy,Drama",50.933333
3813,2018-12-31,Red 11,7000.0,$0,0.0,2018,12,Red 11,Red 11,2019,"Horror,Sci-Fi,Thriller",0.000000
3814,2015-09-29,A Plague So Pleasant,1400.0,$0,0.0,2015,9,A Plague So Pleasant,A Plague So Pleasant,2013,"Drama,Horror,Thriller",0.000000

In [225]:
profit = budget_filter[budget_filter["ROI"] >= 200.0]
profit.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1299 entries, 39 to 3810
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   release_date       1299 non-null   datetime64[ns]
 1   movie              1299 non-null   object
 2   production_budget  1299 non-null   float64
 3   domestic_gross     1299 non-null   object
 4   worldwide_gross    1299 non-null   float64
 5   release_year       1299 non-null   int64
 6   release_month      1299 non-null   int64
 7   primary_title      1299 non-null   object
 8   original_title     1299 non-null   object
 9   start_year         1299 non-null   int64
 10  genres             1275 non-null   object
 11  ROI                1299 non-null   float64
dtypes: datetime64[ns](1), float64(3), int64(3), object(5)
memory usage: 131.9+ KB

In [226]:
profit

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year,release_month,primary_title,original_title,start_year,genres,ROI
39,1976-12-17,King Kong,23000000.0,"$52,614,445",90614445.0,1976,12,King Kong,King Kong,2018,"Action,Adventure",393.975848
40,1933-04-07,King Kong,672000.0,"$10,000,000",10000650.0,1933,4,King Kong,King Kong,2018,"Action,Adventure",1488.191964
65,1999-05-07,The Mummy,80000000.0,"$155,385,488",416385488.0,1999,5,The Mummy,The Mummy,2017,"Action,Adventure,Fantasy",520.481860
71,1974-03-29,The Great Gatsby,7000000.0,"$26,533,200",26533200.0,1974,3,The Great Gatsby,The Great Gatsby,2013,"Drama,Romance",379.045714
82,1992-11-11,Aladdin,28000000.0,"$217,350,219",504050219.0,1992,11,Aladdin,Aladdin,2019,"Adventure,Comedy,Family",1800.179354
...,...,...,...,...,...,...,...,...,...,...,...,...
3797,2015-09-01,Exeter,25000.0,$0,489792.0,2015,9,Exeter,Exeter,2014,Horror,1959.168000
3798,2015-09-01,Exeter,25000.0,$0,489792.0,2015,9,Exeter,Exeter,2015,None,1959.168000
3808,2006-04-28,Clean,10000.0,"$138,711",138711.0,2006,4,Clean,Clean,2017,"Comedy,Drama,Horror",1387.110000
3809,2001-07-06,Cure,10000.0,"$94,596",94596.0,2001,7,Cure,Cure,2011,Drama,945.960000
3810,2001-07-06,Cure,10000.0,"$94,596",94596.0,2001,7,Cure,Cure,2014,None,945.960000

In [227]:
profit.drop_duplicates(subset="movie", keep="first", inplace=True)

In [228]:
profit

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year,release_month,primary_title,original_title,start_year,genres,ROI
39,1976-12-17,King Kong,23000000.0,"$52,614,445",90614445.0,1976,12,King Kong,King Kong,2018,"Action,Adventure",393.975848
65,1999-05-07,The Mummy,80000000.0,"$155,385,488",416385488.0,1999,5,The Mummy,The Mummy,2017,"Action,Adventure,Fantasy",520.481860
71,1974-03-29,The Great Gatsby,7000000.0,"$26,533,200",26533200.0,1974,3,The Great Gatsby,The Great Gatsby,2013,"Drama,Romance",379.045714
82,1992-11-11,Aladdin,28000000.0,"$217,350,219",504050219.0,1992,11,Aladdin,Aladdin,2019,"Adventure,Comedy,Family",1800.179354
138,1991-11-13,Beauty and the Beast,20000000.0,"$376,057,266",608431132.0,1991,11,Beauty and the Beast,La belle et la bête,2014,"Drama,Fantasy,Romance",3042.155660
...,...,...,...,...,...,...,...,...,...,...,...,...
3790,2016-03-18,Krisha,30000.0,"$144,822",144822.0,2016,3,Krisha,Krisha,2015,Drama,482.740000
3795,2000-01-14,The Terrorist,25000.0,"$195,043",195043.0,2000,1,The Terrorist,The Terrorist,2018,Thriller,780.172000
3796,2015-09-01,Exeter,25000.0,$0,489792.0,2015,9,Exeter,Exeter,2015,"Horror,Mystery,Thriller",1959.168000
3808,2006-04-28,Clean,10000.0,"$138,711",138711.0,2006,4,Clean,Clean,2017,"Comedy,Drama,Horror",1387.110000
3809,2001-07-06,Cure,10000.0,"$94,596",94596.0,2001,7,Cure,Cure,2011,Drama,945.960000

In [229]:
profit["movie"].value_counts()

The Grey                            1
Free Birds                          1
Seven Psychopaths                   1
Hell or High Water                  1
Me Before You                       1
                                   ..
Resident Evil: The Final Chapter    1
La La Land                          1
The Shallows                        1
Safety Not Guaranteed               1
Bridesmaids                         1
Name: movie, Length: 857, dtype: int64

In [216]:
result_sql.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3329 entries, 0 to 3328
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   release_date       3329 non-null   object
 1   movie              3329 non-null   object
 2   production_budget  3329 non-null   float64
 3   domestic_gross     3329 non-null   object
 4   worldwide_gross    3329 non-null   float64
 5   release_year       3329 non-null   int64
 6   primary_title      3329 non-null   object
 7   original_title     3329 non-null   object
 8   start_year         3329 non-null   int64
 9   genres             3272 non-null   object
 10  ROI                3329 non-null   float64
dtypes: float64(3), int64(2), object(6)
memory usage: 312.1+ KB

In [217]:
profit['release_month'] = profit['release_date'].dt.month

AttributeError: Can only use .dt accessor with datetimelike values

In [ ]:
result_sql["original_title"].value_counts()

In [ ]:
result_sql.info()

In [ ]:
conn = sqlite3.connect('im.db.zip')
#specify the path to the zip file
zip_file_path = 'data/im.db.zip'

#Extract the SQLite database file from the zip file
with zipfile.ZipFile(zip_file_path, 'r') as zip_ref:
    zip_ref.extractall('unzippedData')

#connect to extracted SQLite database
database_path = 'unzippedData/im.db'
conn = sqlite3.connect(database_path)

In [ ]:
schema_df = pd.read_sql("""

SELECT *
FROM sqlite_master

""", conn)

schema_df

In [ ]:
movie_basic = pd.read_sql('''
    SELECT *
    FROM movie_basics
''', conn)
movie_basic.head()

In [ ]:
movie_basic["start_year"].value_counts()